# casks (apps)
cask 'ghostty@tip'
cask 'kitty'
cask 'rancher'
cask 'windows-app'
cask 'zen'
cask 'font-commit-mono'
cask 'font-symbols-only-nerd-font'
cask 'bruno'
cask 'keycastr'
cask 'basictex'
cask 'maccy'
cask 'itsycal'
cask 'utm'

# formulas n stuff
brew 'git'
brew 'keychain'
brew 'zsh'
brew 'oh-my-posh'
brew 'zsh-vi-mode'
brew 'zsh-autosuggestions'
brew 'neovim'
brew 'lazygit'
brew 'k9s'
brew 'cheat'
brew 'make'
brew 'plantuml'
brew 'go@1.24'
brew 'rust'
brew 'node'
brew 'luarocks'
brew 'eza'
brew 'nerdctl'
brew 'azure-cli'
brew 'kubectl'
brew 'kubelogin'
brew 'kubectx'
brew 'pandoc'
brew 'groff'
brew 'typst'
brew 'ffmpeg'
